samples/queue/impl/CreateRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:queue="http://www.globus.org/QueueService"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>http://www.globus.org/queue/create</wsa:Action>
        <wsa:MessageID>Random</wsa:MessageID>
        <wsa:To>http://localhost:8080/queues</wsa:To>
    </soapenv:Header>
    <soapenv:Body>
        <queue:CreateQueueRequest>MyQueue</queue:CreateQueueRequest>
    </soapenv:Body>
</soapenv:Envelope>
